package com.example.velizara_pc.national100places;

import android.content.Intent;
import android.graphics.drawable.Drawable;
import android.support.v4.content.ContextCompat;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;

import java.io.Serializable;

public class Obecti extends AppCompatActivity {

    int oblastChoise;
    int regChoice;
    String [] oblastList;
    int [] imageID;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_obecti);
        Intent receive = getIntent();
        regChoice = receive.getIntExtra("oblasti", 0);
        oblastChoise = receive.getIntExtra("obect", 0);
        switch (regChoice){
            case 0:
                switch (oblastChoise){
                    case 0:
                        oblastList = new String[] {"Регионален исторически музей - Варна", "Военноморски музей - Варна", "Музей на мозайките - Девня"};
                        imageID = new int[] {R.drawable.am_varna, R.drawable.vm_varna};
                        break;
                    case 1:
                        oblastList = new String[] {"Художествена галерия - Добрич", "Дом - паметник „Й. Йовков“ - Добрич", "комплекс „Двореца“ - Балчик", "Университетска ботаническа градина - Балчик",
                        "Исторически музей Каварна", "археологически резерват „Калиакра”"};
                        break;
                    case 2:
                        oblastList = new String[] {"Исторически музей, Меджиди Табия - Силистра", "резерват Сребърна", "Музей на Дунавския риболов - Тутракан",
                        "Военна гробница - Тутракан"};
                        break;
                    case 3:
                        oblastList = new String[] {"Рег. исторически музей - Шумен", "ИАР Шуменска крепост", "Паметник 1300 г. България - Шумен",
                        "Томбул джамия - Шумен", "Археологически резерват Плиска", "Мадарски конник - с.Мадара", "НАР Велики Преслав - Преслав"};
                        break;
                }
                break;
            case 1:
                switch (oblastChoise){
                    case 0:
                        oblastList = new String[] {"Археологически музей - Несебър", "Музей на солта - Поморие", "Поморийско езеро",
                        "Храм Свети свети Кирил и Методий - Бургас", "Природоз. център Пода", "Исторически музей - Малко Търново",
                        "Местност Петрова нива", "Археологически музей - Созопол", "Общински исторически музей - Царево"};
                        imageID = new int[]{R.drawable.arh_m_nesebar, R.drawable.ms_pomorie};
                        break;
                    case 1:
                        oblastList = new String[] {"Къща-музей Хаджи Димитър - Сливен", "Музей на текстилната индустрия - Сливен",
                        "Художествена галерия - Сливен", "Пантеон на Г.С.Раковски - Котел", "Природонаучен музей - Котел",
                        "Къща-музей Йордан Йовков - Жеравна", "музей Каранова могила - Нова Загора"};
                        break;
                    case 2:
                        oblastList = new String[] {"Исторически музей - Ямбол", "Античен град Кабиле - Ямбол", "Етнографско-археологически музей - Елхово"};
                        break;
                }
                break;
            case 2:
                switch (oblastChoise){
                    case 0:
                        oblastList = new String[] {"Царевец", "Арбанаси", "Регионален исторически музей - Велико Търново",
                        "Къща музей \"Алеко Константинов\" - Свищов", "Къща - музей \"Иларион Макариополски\" - Елена",
                        "Арх. - исторически комплекс - Даскалоливница - Елена"};
                        break;
                    case 1:
                        oblastList = new String[] {"Музей на образованието - Габрово", "Архитектурно-етнографски комплекс „Етъра”",
                        "местността „Узана” - Габрово", "Дом на хумора и сатирата - Габрово", "Архитектурно-исторически резерват Боженци",
                        "музей на резбарското и етнографско изкуство - Трявна", "Дряновски манастир", "Пещера „Бачо Киро“", "Музей „Кольо Фичето“ - Дряново"};
                        break;
                    case 2:
                        oblastList = new String[] {"Музей „Васил Левски“ - Ловеч", "Къкринско ханче", "Национален пещерен дом - Луковит", "Деветашка пещера",
                        "Троянска Света Обител „Усп. Богородично“", "Природонаучен музей - с. Черни Осъм", "Музей на народните худ. занаяти и приложните изкуства - Троян",
                        "Исторически музей - Тетевен", "пещера „Съева дупка“"};
                        break;
                    case 3:
                        oblastList = new String[] {"Регионален исторически музей - Плевен", "Мавзолей-параклис „Св. Георги Победоносец“ - Плевен", "Панорама „Плевенска епопея"};
                        break;
                    case 4:
                        oblastList = new String[] {"Арх. резерват „Абритус“ - Разград", "Исторически музей - Исперих", "ИАР „Сборяново“ - Исперих", "Демир Баба теке“ и тракийски град Хелис – с. Свещари"};
                        break;
                    case 5:
                        oblastList = new String[] {"Пантеон на Възрожденците - Русе", "Къща-музей „Захари Стоянов“ - Русе", "Ивановски скални манастири",
                        "Скален Манастир \"Димитрий Басарбовски\"", "Манастир \"Света Марина\"", "Исторически музей - гр. Бяла"};
                        break;
                    case 6:
                        oblastList = new String[] {"крепост „Мисионис“ - Търговище", "Славейковото училище - Търговище"};
                        break;
                }
                break;
            case 3:
                switch (oblastChoise){
                    case 0:
                        oblastList = new String[] {"Перперикон", "Манастир „Св. Йоан Предтеча“ - Кърджали", "Регионален исторически музей - Кърджали"};
                        break;
                    case 1:
                        oblastList = new String[] {"Къща-музей „Станислав Доспевски” - Пазарджик", "Катедрална църква „Св. Богородица” - Пазарджик",
                        "Регионален исторически музей - Пазарджик","Вила-музей \"Александър стамболийски\"", "Историческа местност „Оборище“", "Къща - музей „Райна Княгиня“", "Пещера – пещера „Снежанка“",
                        "крепост \"Перистера\" - Пещера", "Исторически музей - Батак", "Исторически музей - Велинград", "Исторически музей - Брацигово"};
                        break;
                    case 2:
                        oblastList = new String[] {"Исторически музей - Пловдив", "Етнографски музей - Пловдив", "Античен театър - Пловдив", "Исторически музей - Перущица",
                       "Къща-музей „Иван Вазов“", "Женски метох - Сопот", "Нац. музей „Васил Левски“", "Исторически музей - Карлово", "Нац. музей „Христо Ботев“","Връх Ботев",
                       "Асенова крепост", "Исторически музей - Асеновград", "Бачковски манастир", "комплекс „Бунтовна” - с.Кръстевич", "Тракийска гробница - Старосел",
                       "Археологически музей - Хисаря", "Исторически музей - Клисура"};
                        break;
                    case 3:
                        oblastList = new String[] {"Исторически музей - Смолян", "Планетариум - Смолян", "с. Момчиловци", "пещера Ухловица",
                        "връх Голям Перелик", "Чудните мостове", "Пещера Шаренка", "Триградско ждрело", "Ягодинска пещера", "Буйновско ждрело",
                        "връх Снежанка", "Eтногравски ареален комплекс - Златоград", "Широка Лъка", "Родопски кристал - Мадан"};
                        break;
                    case 4:
                        oblastList = new String[] {"Къща-музей на Пейо К. Яворов - Чирпан", "Худ. галерия „Никола Манев“ - Чирпан", "манастир „Св. Атанасий“ - Златна ливада",
                        "Регионален исторически музей - Стара Загора", "Музей \"Неолитни жилища\" - Стара Загора", "Бранителите на Стара Загора 1877 ",
                        "Тракийска гробница", "музей „Чудомир“ - Казанлък", "Храм „Рождество Христово“ - Шипка", "връх Шипка – Национален парк-музей „Шипка“ - паметник на свободата"};
                        break;
                    case 5:
                        oblastList = new String[] {"Монумент „Света Богородица“ - Хасково", "Средновековна крепост с.Мезек", "Тракийска куполна гробница - с.Мезек",
                        "Вила Армира", "Общински исторически музей - Ивайловград", "Александровска гробница и музеен център", "Исторически музей - Димитровград",
                        "Дом-музей „Пеньо Пенев“", "обсерватория „Джордано Бруно“ - Димитровград"};
                        break;
                }
                break;
            case 4:
                switch (oblastChoise){
                    case 0:
                        oblastList = new String[] {"Исторически музей - Видин", "Крепост \"Баба Вида\"", "Пещера Магурата",
                        "Исторически музей - Белоградчик", "Белоградчишки скали"};
                        break;
                    case 1:
                        oblastList = new String[] {"Пещера Леденика", "Регионален исторически музей - Враца", "връх Околчица – Лобното място на Христо Ботев",
                        "Археологически комплекс „КАЛЕТО” - Мездра",  "Национален музей \"Параход Радецки\"", "Паметник на Христо Ботев и неговата чета"};
                        break;
                    case 2:
                        oblastList = new String[] {"Етнографски музей - Берковица", "Къща музей „Иван Вазов” - Берковица", "връх Ком",
                        "Исторически музей - Чипровци", "манастир „Св. Ив. Рилски” - Чипровци"};
                        break;
                }
                break;
            case 5:
                switch (oblastChoise){
                    case 0:
                        oblastList = new String[] {"Велянова къща", "Къща-музей Неофит Рилски", "Музей Никола Вапцаров", "Иконна изложба",
                        "Църква Св.Троица", "Връх Вихрен", "Църква Св. Св. Теодор Тирон и Теодор Стратилат", "Градски исторически музей Мелник",
                        "Кордопулова къща Мелник", "Светроженски манастир Рождество богородично", "Местност Рупите - храм паметник \"Света Петка Българска\"",
                        "Национален парк-музей „Самуилова крепост“", "Регионален исторически музей  -Благоевград", "Възрожденски комплекс „Вароша”",
                        "Епископска Базилика - Сандански", "Археологически музей-Сандански", "Общински исторически музей-Гоце Делчев"};
                        break;
                    case 1:
                        oblastList = new String[] {"Худ. галерия „Владимир Димитров – Майстора“ - Кюстендил", "Къща-музей „Димитър Пешев“ - Кюстендил",
                        "Музей „Средновековна църква Св. Георги“ - Кюстендил", "Регионален исторически музей - Кюстендил", "Връх Руен", "Музей Рилски манастир",
                        "хижа „Скакавица“ и Седемте рилски езера", "Стобски пирамиди"};
                        break;
                    case 2:
                        oblastList = new String[] {"Ждрелото на р. Ерма - Трън", "Подземен минен музей - Перник"};
                        break;
                }
                break;
            case 6:
                switch (oblastChoise){
                    case 0:
                        oblastList = new String[] {"Национален исторически музей", "Национален музей „Боянска черква“", "Храм-паметник „Александър Невски“",
                        "Национален военноисторически музей", "Национален музей „Земята и хората“", "Национален дворец на културата", "музей за българско изобразително изкуство",
                        "Нац. Етнографски институт с музей", "Национална художествена галерия", "Национален природонаучен музей", "Музей на физическата култура и спорта",
                        "Зоологическа градина ", "Национален антропологичен музей", "Археологически институт с музей при БАН", "Национален политехнически музей"};
                        break;
                    case 1:
                        oblastList = new String[] {"Исторически музей - Етрополе", "Часовниковата кула - Етрополе", "манастир „Св. Троица” - Етрополе",
                        "хижа Алеко - Витоша", "Черни връх – Витоша", "вр. Мусала", "Паметник на Ботевите четници","Копривщица – АИР", "Манарстир ”7-те престола” - Осеновлаг",
                        "Исторически музей - Самоков", "Девически манастир - Самоков", "Цари Мали Град", "Исторически музей - Ботевград", "Часовникова кула - Ботевград"};
                        break;
                }
                break;
        }
        ListView obectiList = (ListView)findViewById(R.id.obectiView);
        ArrayAdapter<String> obectiAdapter = new ArrayAdapter<String>(this, R.layout.obecti_content, R.id.obectiName, oblastList);
        obectiList.setAdapter(obectiAdapter);
        obectiList.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int i, long l) {
                Intent sendObjectInfo = new Intent(view.getContext(), ObectInfo.class);
                sendObjectInfo.putExtra("obectName", oblastList[i]);
                sendObjectInfo.putExtra("photos", imageID[i]);
                startActivity(sendObjectInfo);
            }
        });
    }
}
